package homework_2023_12_18;

public class Task11 {
    //    ***для особо одаренных***
    //    Создайте функциональный интерфейс GraphProcessor с методом process, который принимает матрицу
    //    смежности графа и находит кратчайший путь между двумя вершинами (используя алгоритм Флойда-Уоршелла).
    //    Напишите метод, который принимает матрицу смежности и вершины начала и конца, и GraphProcessor,
    //    и возвращает результат операции.

    public static void main(String[] args) {

    }
}
